# BuiltInFailures.RebarFailures Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..RebarFailures Class
BuiltInFailures Class Members See Also
---
Failures about Rebar.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static class RebarFailures
```

Visual Basic
---
```text
Public NotInheritable Class RebarFailures
```

Visual C++
---
```text
public ref class RebarFailures abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..BuiltInFailures..::..RebarFailures
# See Also
BuiltInFailures..::..RebarFailures Members
Autodesk.Revit.DB Namespace